my_dict = {'Россия': 'Москва', 'США': 'Вашингтон',
           'Израиль': 'Иерусалим', 'Германия': 'Берлин'}  # Словарь

my_set = {1, 'hello', 1, 2, 3, False, (1, 2, 3)}  # Множество

print('Исходный словарь: \33[1;33m')
print(my_dict, '\33[0;0m', '\33[1;31m', end='')
print(type(my_dict), '\33[0;0m')
print('Вывод по ключу:', '\33[0;0m', '\33[3;4m')
print('столица Израиля -->', my_dict['Израиль'], '\33[0;0m', '\n')

print('Добавляем два новых элемента: \33[1;33m')

my_dict.update({'Швейцария': 'Берн',
                'Великобритания': 'Лондон'})

print(my_dict, '\33[1;31m', end='')
print(type(my_dict), '\33[0;0m \n')
print('Удаляем элемент США \33[1;33m')
del my_dict['США']
print(my_dict, '\33[1;31m', end='')
print(type(my_dict), '\33[0;0m \n')

print('Исходное множество: \33[1;35m')
print(my_set, '\33[1;31m', end='')
print(type(my_set), '\33[0;0m','\n')
print('Добавим к множеству список (85,83,92) и строку "Номер_телефона")','\33[1;35m')
my_set.add((85,83,92))
my_set.add("Номер_телефона")
print(my_set, '\33[1;31m', end='')
print(type(my_set), '\33[0;0m', end='\n \n')
print('Удаляем из множества элемент "hello"','\33[1;35m')
my_set.discard("hello")
print(my_set, '\33[1;31m', end='')
print(type(my_set), '\33[0;0m')
my_dict = {'Россия': 'Москва', 'США': 'Вашингтон',
           'Израиль': 'Иерусалим', 'Германия': 'Берлин'}  # Словарь

my_set = {1, 'hello', 1, 2, 3, True, (1, 2, 3)}  # Множество

print('Исходный словарь: \33[1;33m')
print(my_dict, '\33[0;0m', '\33[1;31m', end='')
print(type(my_dict), '\33[0;0m')
print('Вывод по ключу:', '\33[0;0m', '\33[3;4m')
print('столица Израиля -->', my_dict['Израиль'], '\33[0;0m', '\n')

print('Добавляем два новых элемента: \33[1;33m')

my_dict.update({'Швейцария': 'Берн',
                'Великобритания': 'Лондон'})

print(my_dict, '\33[1;31m', end='')
print(type(my_dict), '\33[0;0m \n')
print('Удаляем элемент США \33[1;33m')
del my_dict['США']
print(my_dict, '\33[1;31m', end='')
print(type(my_dict), '\33[0;0m \n')

print('Исходное множество: \33[1;35m')
print(my_set, '\33[1;31m', end='')
print(type(my_set), '\33[0;0m','\n')
print('Добавим к множеству список (85,83,92) и строку "Номер_телефона")','\33[1;35m')
my_set.add((85,83,92))
my_set.add("Номер_телефона")
print(my_set, '\33[1;31m', end='')
print(type(my_set), '\33[0;0m', end='\n \n')
print('Удаляем из множества элемент "hello"','\33[1;35m')
my_set.discard("hello")
print(my_set, '\33[1;31m', end='')
print(type(my_set), '\33[0;0m')
